app/controllers/dynamic_links_controller.rb

SELECT "android_configs".* FROM "android_configs" WHERE "android_configs"."dynamic_link_id" IN (4, 3, 2, 1)
SELECT "dynamic_links".* FROM "dynamic_links" ORDER BY "dynamic_links"."created_at" DESC
SELECT "web_configs".* FROM "web_configs" WHERE "web_configs"."dynamic_link_id" IN (4, 3, 2, 1)
SELECT COUNT(*) FROM "dynamic_links"
SELECT COUNT(*) FROM "clicks"
SELECT COUNT(*) FROM (SELECT DISTINCT "dynamic_links".* FROM "dynamic_links" INNER JOIN "clicks" ON "clicks"."dynamic_link_id" = "dynamic_links"."id" WHERE "clicks"."clicked_at" BETWEEN '2025-07-18 00:00:00' AND '2025-07-18 23:59:59.999999') subquery_for_count
---
  def index
    if current_user.admin?
      # Admin can see all links
      @dynamic_links = DynamicLink.recent.includes(:user, :ios_config, :android_config, :web_config)
      @total_links = DynamicLink.count
      @total_clicks = Click.count
      @links_today = DynamicLink.joins(:clicks).where(clicks: { clicked_at: Date.current.beginning_of_day..Date.current.end_of_day }).distinct.count

SELECT COUNT(*) AS "count_all", DATE_TRUNC('day', "clicks"."clicked_at"::timestamptz AT TIME ZONE 'Etc/UTC')::date AS "date_trunc_day_clicks_clicked_at_timestamptz_at_time_zone_etc_u" FROM "clicks" WHERE "clicks"."dynamic_link_id" = 2 AND ("clicks"."clicked_at" >= '2025-07-12 00:00:00' AND "clicks"."clicked_at" < '2025-07-19 00:00:00') GROUP BY DATE_TRUNC('day', "clicks"."clicked_at"::timestamptz AT TIME ZONE 'Etc/UTC')::date
---
  def show
    @recent_clicks = @dynamic_link.recent_clicks(7).recent.limit(10)
    @clicks_by_platform = @dynamic_link.clicks_by_platform
    @clicks_by_day = @dynamic_link.clicks.group_by_day(:clicked_at, last: 7).count

UPDATE "dynamic_links" SET "social_image_url" = '', "updated_at" = '2025-07-18 14:50:01.177264' WHERE "dynamic_links"."id" = 2
---
  def update
    if @dynamic_link.update(dynamic_link_params)

SELECT COUNT(*) AS "count_all", DATE_TRUNC('day', "clicks"."clicked_at"::timestamptz AT TIME ZONE 'Etc/UTC')::date AS "date_trunc_day_clicks_clicked_at_timestamptz_at_time_zone_etc_u" FROM "clicks" WHERE "clicks"."dynamic_link_id" = 4 AND ("clicks"."clicked_at" >= '2025-06-19 00:00:00' AND "clicks"."clicked_at" < '2025-07-19 00:00:00') GROUP BY DATE_TRUNC('day', "clicks"."clicked_at"::timestamptz AT TIME ZONE 'Etc/UTC')::date
SELECT COUNT(*) AS "count_all", "clicks"."device_type" AS "clicks_device_type" FROM "clicks" WHERE "clicks"."dynamic_link_id" = 4 GROUP BY "clicks"."device_type"
SELECT COUNT(*) AS "count_all", "clicks"."browser_name" AS "clicks_browser_name" FROM "clicks" WHERE "clicks"."dynamic_link_id" = 4 GROUP BY "clicks"."browser_name"
SELECT COUNT(*) AS "count_all", "clicks"."os_name" AS "clicks_os_name" FROM "clicks" WHERE "clicks"."dynamic_link_id" = 4 GROUP BY "clicks"."os_name"
SELECT COUNT(*) AS "count_all", "clicks"."country" AS "clicks_country" FROM "clicks" WHERE "clicks"."dynamic_link_id" = 4 AND "clicks"."country" IS NOT NULL GROUP BY "clicks"."country"
SELECT "clicks".* FROM "clicks" WHERE "clicks"."dynamic_link_id" = 4 ORDER BY "clicks"."clicked_at" DESC LIMIT 50
---
  def analytics
    @clicks_by_day = @dynamic_link.clicks.group_by_day(:clicked_at, last: 30).count
    @clicks_by_platform = @dynamic_link.clicks.group(:device_type).count
    @clicks_by_browser = @dynamic_link.clicks.group(:browser_name).count
    @clicks_by_os = @dynamic_link.clicks.group(:os_name).count
    @clicks_by_country = @dynamic_link.clicks.where.not(country: nil).group(:country).count
    @recent_clicks = @dynamic_link.clicks.recent.limit(50)

SELECT "dynamic_links".* FROM "dynamic_links" WHERE "dynamic_links"."id" = 2 LIMIT 1
---
  def set_dynamic_link
    if current_user.admin?
      @dynamic_link = DynamicLink.find(params[:id])