app/controllers/links_controller.rb

  def find_dynamic_link
    @link = DynamicLink.active.find_by!(short_code: params[:short_code])
---
SELECT "dynamic_links".* FROM "dynamic_links" WHERE "dynamic_links"."active" = TRUE AND "dynamic_links"."short_code" = 'o9WrthMF' LIMIT 1

  def track_click
    device_service = DeviceDetectionService.new(request.user_agent)
    device_info = device_service.device_info

    @link.clicks.create!(
      user_agent: request.user_agent,
      ip_address: request.remote_ip,
      referer: request.referer,
      device_type: device_info[:device_type],
      os_name: device_info[:os_name],
      os_version: device_info[:os_version],
      browser_name: device_info[:browser_name],
      browser_version: device_info[:browser_version],
      country: extract_country_from_ip(request.remote_ip)
    )
---
INSERT INTO "clicks" ("dynamic_link_id", "user_agent", "ip_address", "referer", "device_type", "os_name", "os_version", "browser_name", "browser_version", "country", "clicked_at", "created_at", "updated_at") VALUES (23, 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/138.0.0.0 Safari/537.36', '::1', 'http://localhost:3000/dynamic_links/23', 'desktop', 'Mac', '10.15.7', 'Chrome', '138.0.0.0', NULL, '2025-07-18 15:13:20.765148', '2025-07-18 15:13:20.765221', '2025-07-18 15:13:20.765221') RETURNING "id"