app/models/dynamic_link.rb

  def generate_short_code
    return if short_code.present?
---
SELECT 1 AS one FROM "dynamic_links" WHERE "dynamic_links"."short_code" = '6nnHOz8M' LIMIT 1