app/views/dynamic_links/edit.html.erb

SELECT "android_configs".* FROM "android_configs" WHERE "android_configs"."dynamic_link_id" = 4 LIMIT 1
SELECT "web_configs".* FROM "web_configs" WHERE "web_configs"."dynamic_link_id" = 4 LIMIT 1
---
// Auto-expand sections that have content/errors
document.addEventListener('DOMContentLoaded', function() {
  // Check for iOS config
  <% if @dynamic_link.ios_config&.app_store_id.present? %>
    toggleSection('ios-section');
  <% end %>

  // Check for Android config
  <% if @dynamic_link.android_config&.package_name.present? %>
    toggleSection('android-section');
  <% end %>

  // Check for Web config
  <% if @dynamic_link.web_config&.desktop_url.present? %>
    toggleSection('web-section');
  <% end %>

  // Check for Social config
  <% if @dynamic_link.social_title.present? || @dynamic_link.social_description.present? %>
    toggleSection('social-section');
  <% end %>
