app/views/dynamic_links/index.html.erb

          <p class="text-sm font-medium text-gray-600">Clicks Today</p>
          <p class="text-2xl font-bold text-gray-900"><%= Click.where(clicked_at: Date.current.beginning_of_day..Date.current.end_of_day).count %></p>
---
SELECT COUNT(*) FROM "clicks" WHERE "clicks"."clicked_at" BETWEEN '2025-07-18 00:00:00' AND '2025-07-18 23:59:59.999999'

                    <div class="flex space-x-1">
                      <% if link.ios_config.present? %>
---
SELECT "web_configs".* FROM "web_configs" WHERE "web_configs"."dynamic_link_id" IN (4, 3, 2, 1)

                      <% end %>
                      <% if link.android_config.present? %>
---
SELECT "android_configs".* FROM "android_configs" WHERE "android_configs"."dynamic_link_id" IN (4, 3, 2, 1)
SELECT "web_configs".* FROM "web_configs" WHERE "web_configs"."dynamic_link_id" IN (4, 3, 2, 1)