app/views/dynamic_links/show.html.erb

          <div class="text-center">
            <div class="text-2xl font-bold text-green-600"><%= @dynamic_link.recent_clicks(7).count %></div>
---
SELECT COUNT(*) FROM "clicks" WHERE "clicks"."dynamic_link_id" = 4

      <!-- Platform Configurations -->
      <% if @dynamic_link.ios_config.present? %>
---
SELECT "ios_configs".* FROM "ios_configs" WHERE "ios_configs"."dynamic_link_id" = 2 LIMIT 1


      <% if @dynamic_link.android_config.present? %>
---
SELECT "android_configs".* FROM "android_configs" WHERE "android_configs"."dynamic_link_id" = 2 LIMIT 1


      <% if @dynamic_link.web_config.present? %>
---
SELECT "web_configs".* FROM "web_configs" WHERE "web_configs"."dynamic_link_id" = 2 LIMIT 1